evidence/aws/poc19-capacity-planning/stage3-load-testing/tenant-a-hey-run1.txt
02:23:17 casita@linux-mint platform-capstone ±|main✔|→ hey -z 10m -c 100 http://tenant-a.platform-demo.local/api/

Summary:
  Total:	600.0613 secs
  Slowest:	5.1016 secs
  Fastest:	0.0398 secs
  Average:	0.0613 secs
  Requests/sec:	1631.3467
  
  Total data:	1973060 bytes
  Size/request:	2 bytes

Response time histogram:
  0.040 [1]	|
  0.546 [978486]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.052 [221]	|
  1.558 [0]	|
  2.064 [0]	|
  2.571 [0]	|
  3.077 [1]	|
  3.583 [5]	|
  4.089 [0]	|
  4.595 [0]	|
  5.102 [194]	|


Latency distribution:
  10% in 0.0440 secs
  25% in 0.0474 secs
  50% in 0.0548 secs
  75% in 0.0664 secs
  90% in 0.0804 secs
  95% in 0.0918 secs
  99% in 0.1359 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0398 secs, 5.1016 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0035 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0064 secs
  resp wait:	0.0612 secs, 0.0397 secs, 5.1015 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0039 secs

Status code distribution:
  [200]	978805 responses
  [502]	103 responses



02:33:30 casita@linux-mint platform-capstone ±|main✔|→