evidence/aws/poc19-capacity-planning/stage3-load-testing/tenant-b-hey-run3.txt
02:44:00 casita@linux-mint ~ → hey -z 10m -c 100 http://tenant-b.platform-demo.local/api/

Summary:
  Total:	600.0444 secs
  Slowest:	5.0952 secs
  Fastest:	0.0397 secs
  Average:	0.0603 secs
  Requests/sec:	1658.9539
  
  Total data:	2020364 bytes
  Size/request:	2 bytes

Response time histogram:
  0.040 [1]	|
  0.545 [995031]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.051 [278]	|
  1.556 [2]	|
  2.062 [0]	|
  2.567 [0]	|
  3.073 [0]	|
  3.579 [6]	|
  4.084 [0]	|
  4.590 [0]	|
  5.095 [128]	|


Latency distribution:
  10% in 0.0437 secs
  25% in 0.0470 secs
  50% in 0.0542 secs
  75% in 0.0653 secs
  90% in 0.0789 secs
  95% in 0.0895 secs
  99% in 0.1346 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0397 secs, 5.0952 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0010 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0036 secs
  resp wait:	0.0602 secs, 0.0396 secs, 5.0952 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0043 secs

Status code distribution:
  [200]	995247 responses
  [502]	197 responses
  [504]	2 responses



02:54:29 casita@linux-mint ~ →